<template>
  <div>
    <v-layout
      row
      class="hidden-sm-and-down"
      style="position:absolute; top: 0px; left: 0px; right: 0px; height: 80px;"
    ></v-layout>
    <v-layout row class="hidden-sm-and-down" style="position:absolute; top: 16px; left: 16px;">
      <v-flex xs3>
        <img
          style="max-height: 145px; max-width: 145px;"
          src="/logo-dexcoro-COFFEE.png"
          @click="$router.push('/')"
        />
      </v-flex>
      <v-flex xs6>
        <!-- <v-img
          style="height: 50px; width: 100px; margin-left: 16px; padding: 0px;"
          src="/dezigntoolWhite.png"
          aspect-ratio="1"
          contain
        ></v-img>-->
      </v-flex>
    </v-layout>
    <div style="margin: 120px 80px;">
      <div class="th s20" style="text-align: center;">นโยบายความเป็นส่วนตัว</div>
      <hr />
      <div
        class="th"
      >&nbsp;&nbsp;&nbsp;นโยบายความเป็นส่วนตัวของบริษัทสำหรับการใช้งานแอพพลิเคชั่นด้านล่าง ซึ่งต่อไปนี้จะเรียกว่า “แอพพลิเคชั่น”</div>
      <div
        class="th"
      >โปรดอ่านและทำความเข้าใจนโยบายความเป็นส่วนตัวนี้อย่างละเอียด การที่ท่านได้ติดตั้ง และ/หรือเข้าใช้งานแอพพลิเคชั่นนี้แล้ว ถือว่าท่านตกลงยอมรับข้อกำหนดที่ระบุในนโยบายความเป็นส่วนตัวนี้แล้วทุกประการ หากท่านไม่สามารถยอมรับข้อกำหนดนโยบายความเป็นส่วนตัวนี้ได้ ขอให้ท่านปฏิเสธการใช้งานแอพพลิเคชั่นโดยถอนการติดตั้งแอพพลิเคชั่นจากเครื่องโทรศัพท์เคลื่อนที่/อุปกรณ์ดิจิตอลของท่านทันที</div>

      <div class="th">1. วัตถุประสงค์ของนโยบายความเป็นส่วนตัว</div>
      <div
        class="th"
      >&nbsp;&nbsp;&nbsp;ในการใช้งานแอพพลิเคชั่นนี้ บริษัทมีความประสงค์ที่จะแจ้งให้ท่านทราบอย่างชัดเจนว่าบริษัทรวบรวมข้อมูลอะไรของท่านบ้าง มีวิธีการใช้และแบ่งปันข้อมูลของท่านอย่างไร นโยบายความเป็นส่วนตัวนี้จะอธิบายถึง</div>
      <div class="th">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- ข้อมูลที่รวบรวมและเหตุผลที่รวบรวม</div>
      <div class="th">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- การใช้ข้อมูลที่รวบรวม</div>
      <div
        class="th"
      >บริษัทจะใช้ข้อมูลที่รวบรวมจากแอพพลิเคชั่นทั้งหมดของบริษัท เพื่อให้บริการ บำรุงรักษา ป้องกัน ปรับปรุง พัฒนาบริการใหม่ๆ และปกป้องบริษัทและท่าน ตลอดจนเพื่อนำเสนอเนื้อหาที่ได้รับการปรับแต่ง (Customize) ให้เหมาะสมกับการใช้งานของท่านโดยเฉพาะ เช่น แสดงผลการค้นหาที่เกี่ยวข้องกับท่าน แสดงโฆษณาประชาสัมพันธ์บริการที่ท่านอาจสนใจและเป็นประโยชน์แก่ท่าน</div>

      <div class="th">2. ความปลอดภัยของข้อมูล</div>
      <div
        class="th"
      >&nbsp;&nbsp;&nbsp;บริษัทพยายามอย่างยิ่งที่จะปกป้องข้อมูลของท่านจากการเข้าถึง การแก้ไขเปลี่ยนแปลง การเปิดเผย หรือการทำลายโดยไม่ได้รับอนุญาต อย่างน้อยดังนี้</div>
      <div
        class="th"
      >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- บริษัทตรวจสอบการเก็บรวบรวมข้อมูล พื้นที่ในการจัดเก็บข้อมูลและหลักปฏิบัติในการประมวลผล รวมถึงมาตรการความปลอดภัยทางกายภาพ เพื่อป้องกันการเข้าถึงข้อมูลโดยไม่ได้รับอนุญาต</div>

      <div class="th">3. ข้อจำกัดการใช้นโยบายความเป็นส่วนตัว</div>
      <div
        class="th"
      >&nbsp;&nbsp;&nbsp;นโยบายความเป็นส่วนตัวฉบับนี้ มีผลใช้บังคับกับแอพพลิเคชั่นนี้เท่านั้น ไม่รวมถึงแอพพลิเคชั่นและ/หรือบริการที่มีนโยบายความเป็นส่วนตัว แยกต่างหาก และ/หรือที่ไม่ได้กำหนดโดยชัดแจ้งให้ใช้ร่วมกันกับนโยบายความเป็นส่วนตัวนี้ ตลอดจนไม่มีผลใช้บังคับกับแอพพลิเคชั่นและบริการ หรือเว็บไซต์อื่นๆ ที่เชื่อมต่อ (link) กับแอพพลิเคชั่นนี้ รวมถึงไม่ครอบคลุมหลักปฏิบัติด้านข้อมูลส่วนบุคคลของบริษัทอื่นๆ หรือองค์กรอื่นๆ ที่โฆษณาแอพพลิเคชั่นของบริษัท ซึ่งอาจใช้คุกกี้ พิกเซลแท็ก และเทคโนโลยีอื่นๆ ในการนำเสนอและแสดงโฆษณาที่เกี่ยวข้อง</div>

      <div class="th">4. การปฏิบัติตามกฎหมายและการให้ความร่วมมือกับหน่วยงานกำกับดูแล</div>
      <div
        class="th"
      >&nbsp;&nbsp;&nbsp;บริษัทดำเนินการตรวจสอบและทบทวนการปฏิบัติตามนโยบายความเป็นส่วนตัว และการปฏิบัติตามกฎหมายที่เกี่ยวข้อง ภายในองค์กรอย่างสม่ำเสมอ (Self-Regulator) หากบริษัทได้รับหนังสือร้องเรียนเกี่ยวกับการใช้ข้อมูลส่วนบุคคล บริษัทจะดำเนินการติดตามผล ตลอดจนให้ความร่วมมือกับหน่วยงานของรัฐที่มีอำนาจกำกับดูแลการให้บริการแอพพลิเคชั่น และหน่วยงานคุ้มครองผู้บริโภคต่างๆ</div>

      <div class="th">5. การเข้าถึงและอัปเดตข้อมูลส่วนบุคคล</div>
      <div class="th">
        &nbsp;&nbsp;&nbsp;บริษัทมุ่งหวังเป็นอย่างยิ่งว่า ในการใช้แอพพลิเคชั่น ท่านสามารถเข้าถึงข้อมูลส่วนบุคคลของท่านได้ หากข้อมูลดังกล่าวมีความบกพร่องหรือไม่ถูกต้อง บริษัทจะพยายามจัดหาวิธีการ และ/หรือช่องทางให้ท่านสามารถอัปเดตและ/หรือลบข้อมูลส่วนบุคคลของท่านได้อย่างเหมาะสม เว้นแต่ ในกรณีมีความจำเป็นที่บริษัทจะต้องจัดเก็บข้อมูลส่วนบุคคลของท่านไว้ เพื่อประโยชน์ทางธุรกิจ และ/หรือเพื่อการปฏิบัติตามกฎหมายที่ใช้บังคับ เมื่อท่านดำเนินการอัปเดตข้อมูลส่วนบุคคลของท่าน บริษัทอาจร้องขอให้ท่านยืนยันตัวตนก่อนที่บริษัทจะดำเนินการตามคำขอของท่านได้ ทั้งนี้ บริษัทขอสงวนสิทธิ์ปฏิเสธการทำคำขออัปเดตและการเข้าถึงข้อมูลส่วนบุคคลของท่าน ในกรณีดังต่อไปนี้ (1) การทำคำขอที่ซับซ้อนและมีจำนวนมากเกินกว่าปกติ (2) การดำเนินการตามคำขออาจทำให้บริษัทต้องจัดหา และ/หรือพัฒนาเทคโนโลยีจากที่บริษัทมีอยู่เกินสมควร (3) การดำเนินการตามคำขออาจกระทบข้อมูลส่วนบุคคลของผู้ใช้งานแอพพลิเคชั่นอื่นๆ หรือ (4) การดำเนินการตามคำขอไม่สามารถปฏิบัติได้จริง เช่น คำขอเกี่ยวกับการเรียกดูข้อมูลส่วนบุคคลที่อยู่ในระบบสำรองข้อมูล
        บริษัทมุ่งหวังที่จะดำเนินการให้บริการแอพพลิเคชั่นของบริษัทเป็นไปอย่างปลอดภัย และสามารถป้องกันการทำลายข้อมูลจากอุบัติเหตุหรือการมุ่งร้ายอื่นๆ ด้วยเหตุนี้ ภายหลังจากที่ท่านลบข้อมูลออกจากแอพพลิเคชั่นของบริษัทแล้ว บริษัทอาจยังไม่ดำเนินการลบสำเนาข้อมูลส่วนบุคคลที่มีอยู่ออกจากเซิร์ฟเวอร์ที่ใช้งานอยู่ หรือนำข้อมูลออกจากระบบสำรองของบริษัทในทันที
      </div>
    </div>
  </div>
</template>

<script>
export default {
  layout: "mobile"
};
</script>